backend/app/graphql/mutations/create_user.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Franny confusion"], ["created_at", "2019-03-01 17:38:09.129504"], ["updated_at", "2019-03-01 17:38:09.129504"]]
---
    def resolve(name:)
      user = User.new(name: name)
      if user.save