backend/app/graphql/types/query_type.rb

    def user(id:)
      User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]