backend/app/graphql/types/query_type.rb

    def user(args)
      User.find_by(first_name: args[:first_name])
---
SELECT  "users".* FROM "users" WHERE "firstName"."first_name" = $1 LIMIT $2  [["first_name", "Mister"], ["LIMIT", 1]]